tests/solver_wrappers/openfoam/test_v10/tube3d/setup_openfoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformTotalPressure;
        p0              table
    (
        (0 1.3332)
        (0.003 1.3332)
        (0.0031 0)
        (0.01 0)
    );

    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;

    }

    mantle
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
